import streamlit as st
from supabase import create_client, Client

# --- Ініціалізація клієнта Supabase (один раз для всього застосунку) ---
# Цей блок буде виконуватись один раз і клієнт буде доступний для всіх сторінок
try:
    SUPABASE_URL = st.secrets["supabase"]["url"]
    SUPABASE_KEY = st.secrets["supabase"]["key"]
    supabase: Client = create_client(SUPABASE_URL, SUPABASE_KEY)
except Exception as e:
    # Виводимо помилку на будь-якій сторінці, якщо підключення не вдалося
    st.error("Помилка ініціалізації Supabase. Перевірте ваш файл .streamlit/secrets.toml.")
    st.stop()


# --- Словник-довідник для препаратів ---
# Зберігаємо його тут, щоб він був доступний для сторінки завантаження
PRODUCTS_DICT = {
       "Аденофіт-форте №60": "Лінія 1",
    "Анксіомедін №20": "Лінія 1",
    "Анксіомедін №60": "Лінія 1",
    "Антистрес №30": "Лінія 1",
    "Антистрес №60": "Лінія 1",
    "Астадінол 2000 №30": "Лінія 1",
    "Астадінол 4000 №30": "Лінія 1",
    "Атеродінол №60": "Лінія 2",
    "Візінорм №30": "Лінія 2",
    "Візінорм №60": "Лінія 2",
    "Глюцемедін №30": "Лінія 1",
    "Глюцемедін №60": "Лінія 1",
    "Депріліум №30": "Лінія 1",
    "Дуонефрил №30": "Лінія 1",
    "Дуонефрил №60": "Лінія 1",
    "Дуонефрил №90": "Лінія 1",
    "Дуонефрил-500 №30": "Лінія 1",
    "Дуонефрил-500 №60": "Лінія 1",
    "Дуонефрил-500 №90": "Лінія 1",
    "Зобофіт №60": "Лінія 2",
    "Зобофіт ДУО №30": "Лінія 2",
    "Зобофіт ДУО №60": "Лінія 2",
    "Зобофіт Селен №60": "Лінія 2",
    "Імунсил D3 №30": "Лінія 1",
    "Імунсил D3 №60": "Лінія 1",
    "Імунсил D3 ДУО №30": "Лінія 1",
    "Імунсил D3 ДУО №60": "Лінія 1",
    "Індомірол №30": "Лінія 1",
    "Індомірол №60": "Лінія 1",
    "Індомірол-М №30": "Лінія 1",
    "Індомірол-М №60": "Лінія 1",
    "Індомірол-форте №60": "Лінія 1",
    "Індомірол-М форте №60": "Лінія 1",
    "Інулін-НУТРІМЕД №60": "Лінія 1",
    "Інулін-Нутрімед №60": "Лінія 1",
    "Камавіт-форте №60": "Лінія 2",
    "Когніора №30": "Лінія 2",
    "Ліводінол №60": "Лінія 2",
    "Ліводінол Макс №40": "Лінія 2",
    "Меномедін №30": "Лінія 2",
    "Меномедін-М №60": "Лінія 2",
    "Монморол №30": "Лінія 1",
    "Монморол №60": "Лінія 1",
    "Неопрост-форте №30": "Лінія 2",
    "Неопрост-форте №60": "Лінія 2",
    "Оварімедін №60": "Лінія 2",
    "Ресверазин №30": "Лінія 2",
    "Ресверазин №60": "Лінія 2",
    "Сономедін №20": "Лінія 1",
    "Церебровітал №30": "Лінія 2",
    "Церебровітал №60": "Лінія 2",
    "Церебровітал Актив №30": "Лінія 2",
    "Цинкоферол-4000 №30": "Лінія 1",
    "яАцерола-С 500 №30": "Лінія 1",
    "яІмунсил №20": "Лінія 1",
    "яКамавіт-форте №30": "Лінія 2",
    "яЦинкоферол - С №30": "Лінія 1"
}
